# FabricWireType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricWireType Class
Members See Also
---
A Fabric Wire Type object that is used in the generation of Fabric Wire.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FabricWireType : ElementType
```

Visual Basic
---
```text
Public Class FabricWireType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class FabricWireType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..FabricWireType
# See Also
FabricWireType Members
Autodesk.Revit.DB.Structure Namespace